<?php
/*
Plugin Name: Mankutimmana Kagga
Plugin URI: http://www.prasannasp.net/wordpress-plugins/mankutimmana-kagga/
Description: This plugin creates a widget which shows a random poem from Mankutimmana Kagga, written by Sri D.V.Gundappa. You can add this widget to any widgetized areas, such as sidebars.
Author: Prasanna SP
Version: 1.0
Author URI: http://www.prasannasp.net/
*/

/*  This file is part of Mankutimmana Kagga plugin, developed by Prasanna SP (email: prasanna@prasannasp.net)

    Mankutimmana Kagga is written by Dr. D.V.Gundappa. Most of the poems used in this plugin are taken from http://wordsofwisdom.in/mankutimmanakagga/

    Mankutimmana Kagga is free software: you can redistribute it and/or modify
    it under the terms of the GNU General Public License as published by
    the Free Software Foundation, either version 3 of the License, or
    (at your option) any later version.

    Mankutimmana Kagga is distributed in the hope that it will be useful,
    but WITHOUT ANY WARRANTY; without even the implied warranty of
    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
    GNU General Public License for more details.

    You should have received a copy of the GNU General Public License
    along with Mankutimmana Kagga plugin. If not, see <http://www.gnu.org/licenses/>.
*/

function dvg_kaggas() {
	$lines = "ಶ್ರೀ ವಿಷ್ಣು ವಿಶ್ವಾದಿ ಮೂಲ ಮಾಯಾಲೋಲ ।<br />ದೇವ ಸರ್ವೇಶ ಪರಬೊಮ್ಮನೆಂದು ಜನಂ ॥<br />ಆವುದನು ಕಾಣದೊಡಮಳ್ತಿಯಿಂ ನಂಬಿಹುದೊ ।<br />ಆ ವಿಚಿತ್ರಕೆ ನಮಿಸೊ – ಮಂಕುತಿಮ್ಮ ॥ ೧ ॥
ಜೀವ ಜಡರೂಪ ಪ್ರಪಂಚವನದಾವುದೋ।<br />ಆವರಿಸಿಕೊಂಡುಮೊಳನೆರೆದುಮಿಹುದಂತೆ॥<br />ಭಾವಕೊಳಪಡದಂತೆ ಅಳತೆಗಳವಡದಂತೆ।<br />ಆ ವಿಶೇಷಕೆ ನಮಿಸೊ – ಮಂಕುತಿಮ್ಮ ॥ ೨ ॥
ಇಹುದೊ ಇಲ್ಲವೊ ತಿಳಿಯಗೊಡದೊಂದು ವಸ್ತು ನಿಜ।<br />ಮಹಿಮೆಯಿಂ ಜಗವಾಗಿ ಜೀವವೇಷದಲಿ ॥<br />ವಿಹರಿಪುದದೊಳ್ಳಿತೆಂಬುದು ನಿಸದವಾದೊಡಾ ।<br />ಗಹನ ತತ್ತ್ವಕೆ ಶರಣೊ – ಮಂಕುತಿಮ್ಮ ॥ ೩ ॥
ಏನು ಜೀವನದರ್ಥ? ಏನು ಪ್ರಪಂಚಾರ್ಥ? ।<br />ಏನು ಜೀವಪ್ರಪಂಚಗಳ ಸಂಬಂಧ? ॥<br />ಕಾಣದಿಲ್ಲಿ‍ರ್ಪುದೇನಾನುಮುಂಟೆ? ಅದೇನು? ।<br />ಜ್ಞಾನಪ್ರಮಾಣವೇಂ? – ಮಂಕುತಿಮ್ಮ ॥ ೪ ॥
ದೇವರೆಂಬುದದೇನು ಕಗ್ಗತ್ತಲೆಯ ಗವಿಯೆ? ।<br />ನಾವರಿಯಲಾರದೆಲ್ಲದರೊಟ್ಟು ಹೆಸರೆ? ॥<br />ಕಾವನೊರ್ವನಿರಲ್ಕೆ ಜಗದ ಕಥಯೇಕಿಂತು? ।<br />ಸಾವು ಹುಟ್ಟುಗಳೆನು? – ಮಂಕುತಿಮ್ಮ ॥ ೫ ॥
ಒಗಟೆಯೇನೀ ಸೃಷ್ಟಿ? ಬಾಳಿನರ್ಥವದೇನು? ।<br />ಬಗೆದು ಬಿಡಿಸುವರಾರು ಸೊಜಿಗವನಿದನು? ॥<br />ಜಗವ ನಿರವಿಸಿದ ಕೈಯೊದಾದೊಡೇಕಿಂತು ।<br />ಬಗೆಬಗೆಯ ಜೀವಗತಿ? – ಮಂಕುತಿಮ್ಮ ॥ ೬ ॥
ಬದುಕಿಗಾರ್ ನಾಯಕರು, ಏಕನೊ ಅನೇಕರೋ? ।<br />ವಿಧಿಯೊ ಪೌರುಷವೊ ಧರುಮವೊ ಅಂಧಬಲವೋ? ॥<br />ಕುದುರುವುದೆಂತು ಈಯವ್ಯವಸ್ಥ್ರೆಯ ಪಾಡು? ।<br />ಅದಿಗುದಿಯೆ ಗತಿಯೇನೋ? – ಮಂಕುತಿಮ್ಮ ॥ ೭ ॥
ಕ್ರಮವೊಂದು ಲಕ್ಷ್ಯವೊಂದುಂಟೇನು ಸೃಷ್ಟಿಯಲಿ? ।<br />ಭ್ರಮಿಪುದೇನಾಗಾಗ ಕರ್ತೃವಿನ ಮನಸು? ॥<br />ಮಮತೆಯುಳ್ಳವನಾತನಾದೊಡೀ ಜೀವಗಳು ।<br />ಶ್ರಮಪಡುವುವೇಕಿಂತು? – ಮಂಕುತಿಮ್ಮ ॥ ೮ ॥
ಏನು ಭೈರವಲೀಲೆಯೀ ವಿಶ್ವವಿಭ್ರಮಣೆ ।<br />ಏನು ಭೂತಗ್ರಾಮನರ್ತನೊನ್ಮಾದ ॥<br />ಏನಗ್ನಿ ಗೋಳಗಳು! ಏನಂತರಾಳಗಳು! ।<br />ಏನು ವಿಸ್ಮಯ ಸೃಷ್ಟಿ! – ಮಂಕುತಿಮ್ಮ ॥ ೯ ॥
ಏನು ಪ್ರಪಂಚವಿದು! ಏನು ಧಾಳಾಧಾಳಿ!।<br />ಏನದ್ಭುತಾಪಾರಶಕ್ತಿನಿರ್ಘಾತ! ॥<br />ಮಾನವನ ಗುರಿಯೇನು? ಬೆಲೆಯೇನು? ಮುಗಿವೇನು?।<br />ಏನರ್ಥವಿದಕೆಲ್ಲ?- ಮಂಕುತಿಮ್ಮ ॥ ೧೦ ॥
ಮುತ್ತಿರುವುದಿಂದು ಭೂಮಿಯನೊಂದು ದುರ್ದೈವ ।<br />ಮೃತ್ಯು ಕುಣಿಯುತಲಿಹನು ಕೇಕೆಹಾಕುತಲಿ ॥<br />ಸುತ್ತಿಪುದು ತಲೆಯನನುದಿನದ ಲೋಕದ ವಾರ್ತೆ ।<br />ಎತ್ತಲಿದಕೆಲ್ಲ ಕಡೆ? – ಮಂಕುತಿಮ್ಮ ॥ ೧೧ ॥
ಮಾನವರೋ ದಾನವರೋ ಭೂಮಾತೆಯ ತಣಿಸೆ ।<br />ಶೋಣಿತವನೆರೆಯುವರು ಬಾಷ್ಪ ಸಲುವುದಿರೆ? ॥<br />ಏನು ಹಗೆ! ಏನು ಧಗೆ! ಏನು ಹೊಗೆ! ಯೀ ಧರಣಿ  ।<br />ಸೌನಿಕನ ಕಟ್ಟೆಯೇಂ? – ಮಂಕುತಿಮ್ಮ ॥ ೧೨ ॥
ಪುರುಷಸ್ವತಂತ್ರೆಯ ಪರಮಸಿದ್ಧಿಯದೇನು? ।<br />ಧರಣಿಗನುದಿನದ ರಕ್ತಾಭಿಷೇಚನೆಯೆ? ॥<br />ಕರವಾಲವನು ಪುಷ್ಪಸರವೆಂದು ಸೆಳೆದಾಡೆ ।<br />ಪರಿಮಳವ ಸೂಸುವುದೆ? – ಮಂಕುತಿಮ್ಮ ॥ ೧೩ ॥
ಒಂದೆ ಗಗನವ ಕಾಣುತೊಂದೆ ನೆಲವನು ತುಳಿಯು ।<br />ತೊಂದೆ ಧಾನ್ಯವನುಣ್ಣುತೊಂದೆ ನೀರ್ಗುಡಿದು ॥<br />ಒಂದೆ ಗಾಳಿಯನುಸಿರ್ವ ನರಜಾತಿಯೊಳಗೆಂತು ।<br />ಬಂದುದೀ ವೈಷಮ್ಯ? – ಮಂಕುತಿಮ್ಮ ॥ ೧೪ ॥
ಹಳೆಯ ಭಕ್ತಿಶ್ರದ್ಧೆಯಳಿಸಿಹೋಗಿವೆ ಮಾಸಿ ।<br />ಸುಳಿದಿಲ್ಲವಾವ ಹೊಸ ದರ್ಶನದ ಹೊಳಪುಂ ॥<br />ಪಳಗಿದ್ದ ಮನೆ ಬಿದ್ದ ಕುಂಟ ಕುರುಡನ ತೆರದಿ ।<br />ತಳಮಳಿಸುತಿದೆ ಲೋಕ – ಮಂಕುತಿಮ್ಮ ॥ ೧೫ ॥
ಇಳೆಯ ಬಿಟ್ಟಿನ್ನು ಮೆತ್ತಲುಮೈದದ ಪ್ರೇತ ।<br />ವಲೆವಂತೆ ಲೋಕ ತಲ್ಲಣಿಸುತಿಹುದಿಂದು ॥<br />ಹಳೆಧರ್ಮ ಸತ್ತಿಹುದು ಹೊಸಧರ್ಮ ಹುಟ್ಟಿಲ್ಲ |<br />ತಳಮಳಕೆ ಕಡೆಯೆಂದೊ? – ಮಂಕುತಿಮ್ಮ ॥ ೧೬ ॥
ತಳಮವಿದೇನಿಳೆಗೆ? ದೇವದನುಜರ್ಮಥಿಸೆ ।<br />ಜಳನಿಧಿಯೊಳಾದಂತೆ ಸುಧೆಗೆ ಪೀಠಿಕೆಯೇಂ? ॥<br />ಹಾಳಾಹಳಾವ ಕುಡಿವ ಗಿರಿಶನಿದ್ದಿರ್ದೊಡೀ । <br />ಕಳವಳವದೇತಕೆಲೋ? – ಮಂಕುತಿಮ್ಮ ॥ ೧೭ ॥
ನದಿಯ ತೆರೆಯವೊಲುರುಳಿ ಹೊರಳುತಿರುವುದು  ಜೀವ ।<br />ಮೊದಲಿಲ್ಲ ಮುಗಿವಿಲ್ಲ ನಿಲುವಿಲ್ಲವದಕೆ  ॥<br />ಬದುಕೇನು ಸಾವೇನು ಸೊದೆಯೇನು ವಿಷವೇನು? ।<br />ಉದಕಬುದ್ಬುದವೆಲ್ಲ! – ಮಂಕುತಿಮ್ಮ ॥ ೧೮ ॥
ಗಾಳಿ ಮಣ್ಣುಂಡೆಯೊಳಹೊಕ್ಕು ಹೊರಹೊರಳದು ।<br />ಆಳೆನಿಪುದಂತಾಗದಿರೆ ಬರಿಯ ಹೆಂಟೆ ॥<br />ಬಾಳೇನು ಧೂಳು ಸುಳಿ, ಮರ ತಿಕ್ಕಿದುರಿಯ ಹೊಗೆ ।<br />ಕ್ಷೇಳವೇನಮೃತವೇಂ – ಮಂಕುತಿಮ್ಮ ॥ ೧೯ ॥
ಕಂಡ ದೈವಕ್ಕೆಲ್ಲ ಕೈಯ ಮುಗಿದೇನಹುದು? ।<br />ಚಂಡಚತುರೋಪಾಯದಿಂದಲೇನಹುದು? ॥<br />ತಂಡುಲದ ಹಿಡಿಯೊಂದು ತುಂಡು ಬಟ್ಟೆಯದೊಂದು ।<br />ಅಂಡಲೆತವಿದಕೇನೊ? – ಮಂಕುತಿಮ್ಮ ॥ ೨೦ ॥
ಹೊನ್ನೆಂದು ಜಗದಿ ನೀಂ ಕೈಗೆ ಕೊಂಡುದನು ವಿಧಿ ।<br />ಮಣ್ಣೆನುವನ್; ಅವನ ವರ ಮಣ್ಣೆನುವೆ ನೀನು ॥<br />ಭಿನ್ನಮಿಂತಿರೆ ವಸ್ತುಮೌಲ್ಯಹಳ ಗಣನೆಯೀ ।<br />ಪಣ್ಯಕ್ಕೆ ಗತಿಯೆಂತೊ? – ಮಂಕುತಿಮ್ಮ ॥ ೨೧ ॥
ಕೃತ್ರಿಮವೊ ಜಗವೆಲ್ಲ! ಸತ್ಯತೆಯದೆಲ್ಲಿಹುದೊ? ।<br />ಕರ್ತೃವೆನಿಸಿದನೆ ತಾಂ ಗುಪ್ತನಾಗಿಹನು ॥<br />ಚತ್ರವೀ ಜಗವಿದರೊಳಾರ ಗುಣವೆಂತಹುದೊ! ।<br />ಯಾತ್ರಿಕನೆ, ಜಾಗರಿರೊ – ಮಂಕುತಿಮ್ಮ ॥ ೨೨ ॥
ತಿರುತಿರುಗಿ ತೊಳಲುವುದು ತಿರಿದನ್ನವುಣ್ಣುವುದು ।<br />ಮೆರೆದು ಮೈಮರೆಯುವುದು ಹಲ್ಲ ಕಿರಿಯುವುದು ॥<br />ಮರಳಿ ಕೊರಗಾಡುವುದು ಕೆರಳುವುದು ನರಳುವುದು ।<br />ಇರವಿದೇನೊಣರಗಳೆ? – ಮಂಕುತಿಮ್ಮ ॥ ೨೩ ॥
ನರರ ಭಯಬಯಕೆಗಳೆ ಸುರರ ತಾಯ್ತಂದೆಗಳೊ? ।<br />ಸುರರಟ್ಟಹಾಸದಿನೆ ನರಭಕ್ತಿಯೊರಲೋ? ॥<br />ಪರಿಕಿಸುವರೇನವರ್ಗಳನ್ಯೋನ್ಯಶಕ್ತಿಗಳ? ।<br />ಧರುಮವೆಲ್ಲಿದರಲ್ಲಿ? – ಮಂಕುತಿಮ್ಮ ॥ ೨೪ ॥
ಜೀವಗತಿಗೊಂದು ರೇಖಾಲೇಖವಿರಬೇಕು ।<br />ನಾವಿಕನಿಗಿರುವಂತೆ ದಿಕ್ಕು ದಿನವೆಣಿಸೆ ॥<br />ಭಾವಿಸುವುದೆಂತದನು ಮೊದಲು ಕೊನೆ ತೋರದಿರೆ? ।<br />ಆವುದೀ ಜಗಕಾದಿ? – ಮಂಕುತಿಮ್ಮ ॥ ೨೫ ॥
ಸೃಷ್ಟಿಯಾಶಯವದೇನಸ್ಪಷ್ಟ ಸಂಶ್ಲಿಷ್ಟ ।<br />ಇಷ್ಟ ಮೊಹಕ ದಿವ್ಯಗುಣಗಳೊಂದು ಕಡೆ ॥<br />ಕಷ್ಟ ಭೀಭತ್ಸ ಘೋರಂಗಳಿನ್ನೊಂದು ಕಡೆ ।<br />ಕ್ಲಿಷ್ಟವೀ ಬ್ರಹ್ಮಕೃತಿ – ಮಂಕುತಿಮ್ಮ ॥ ೨೬ ॥
ಧರೆಯ ಬದುಕೇನದರ ಗುರಿಯೇನು ಫಲವೇನು? ।<br />ಬರಿ ಬಳಸು ಬಡಿದಾಟ ಬರಿ ಪರಿಭ್ರಮಣೆ ॥<br />ತಿರುತಿರುಗಿ ಹೊಟ್ಟೆ ಹೊರಕೊಳುವ ಮೃಗಖಗಕಿಂತ ।<br />ನರನು ಸಾಧಿಪುದೇನು? – ಮಂಕುತಿಮ್ಮ ॥ ೨೭ ॥
ಕಾರುಣ್ಯ ಸರಸ ಸೌಂದರ್ಯ ರುಚಿಗಳೆ ಸೃಷ್ಟಿ- ।<br />ಕಾರಣಮೆನಿಪ್ಪವೊಲು ತೋರ್ಪುದೊಂದು ಚಣ ॥<br />ಕಾರ್ಪಣ್ಯ ಕಟುಕತೆಗಳೆನಿಪುದಿನ್ನೊಂದು ಚಣ ।<br />ತೋರದಾವುದು ದಿಟವೊ – ಮಂಕುತಿಮ್ಮ ॥ ೨೮ ॥
ಎರಡುಮಿರಬಹುದು ದಿಟ; ಶಿವರುದ್ರನಲೆ ಬೊಮ್ಮ! ।<br />ಕರವೊಂದರಲಿ ವೇಣು, ಶಂಖವೊಂದರಲಿ! ॥<br />ಬೆರಳ್ಗಳೆರಡಾನುಮಿರೆ ಕೈ ಚಿಟಿಕೆಯಾಡುವುದು ।<br />ಒರುವನಾಡುವುದೆಂತು? – ಮಂಕುತಿಮ್ಮ ॥ ೨೯ ॥
ಬ್ರಹ್ಮವೇ ಸತ್ಯ, ಸೃಷ್ಟಿಯೆ ಮಿಥ್ಯೆಯೆನ್ನುವೊಡೆ ।<br />ಸಂಬಂಧವಿಲ್ಲವೇನಾ ವಿಷಯಯುಗಕೆ? ॥<br />ನಮ್ಮ ಕಣ್ಮನಸುಗಳೆ ನಮಗೆ ಸಟೆ ಪೇಳುವೊಡೆ ।<br />ನೆಮ್ಮುವುದದಾರನೋ? – ಮಂಕುತಿಮ್ಮ ॥ ೩೦ ॥
ಬಚ್ಚಿಟ್ಟುಕೊಂಡಿಹುದೆ ಸತ್ಯ ಮಿಥ್ಯೆಯ ಹಿಂದೆ? ।<br />ನಚ್ಚುವುದೆ ಮರೆಯೊಳಿಹುದನೆ ಸತ್ಯವೆಂದು? ॥<br />ಅಚ್ಚರಿಯ ತಂತ್ರವಿದು; ಬ್ರಹ್ಮಸೃಷ್ಟಿಗಳೇಕೊ ।<br />ಮುಚ್ಚಿಹವು ಸಾಜತೆಯ – ಮಂಕುತಿಮ್ಮ ॥ ೩೧ ॥
ಪರಬೊಮ್ಮನೀ ಜಗವ ರಚಿಸಿದವನಾದೊಡದು ।<br />ಬರಿಯಾಟವೋ ಕನಸೊ ನಿದ್ದೆ ಕಲವರವೋ? ॥<br />ಮರುಳನವನಲ್ಲದೊಡೆ ನಿಯಮವೊಂದಿರಬೇಕು ।<br />ಗುರಿಗೊತ್ತದೇನಿಹುದೊ? – ಮಂಕುತಿಮ್ಮ ॥ ೩೨ ॥
ನರಪರೀಕ್ಷೆಯೆ ಬೊಮ್ಮನಾಶಯವೆ? ನಮ್ಮ ಬಾಳ್ ।<br />ಬರಿ ಸಮಸ್ಯೆಯೆ? ಅದರ ಪೂರಣವದೆಲ್ಲಿ? ॥<br />ಸುರಿದು ಪ್ರಶ್ನೆಗಳನುತ್ತರವ ಕುಡೆ ಬಾರದನ ।<br />ಗುರುವೆಂದು ಕರೆಯುವೆಯ? – ಮಂಕುತಿಮ್ಮ ॥ ೩೩ ॥
ಎಷ್ಟು ಚಿಂತಿಸಿದೊಡಂ ಶಂಕೆಯನೆ ಬೆಳಸುವೀ ।<br />ಸೃಷ್ಟಿಯಲಿ ತತ್ತ್ವವೆಲ್ಲಿಯೋ ಬೆದಕಿ ನರನು ॥<br />ಕಷ್ಟಪಡುತಿರಲೆನುವುದೋ ಬ್ರಹ್ಮವಿಧಿಯೇನೋ! ।<br />ಅಷ್ಟೆ ನಮ್ಮಯ ಪಾಡು? – ಮಂಕುತಿಮ್ಮ ॥ ೩೪ ॥
ಇರಬಹುದು; ಚಿರಕಾಲ ಬೊಮ್ಮ ಚಿಂತಿಸಿ ದುಡಿದು ।<br />ನಿರವಿಸಿಹ ವಿಶ್ವಚಿತ್ರವ ಮರ್ತ್ಯನರನು ॥<br />ಅರಿತೆನಾನೆನ್ನುವಂತಾಗೆ ಕೃತಿ ಕೌಶಲದ ।<br />ಹಿರಿಮೆಗದು ಕುಂದಲ್ತೆ? – ಮಂಕುತಿಮ್ಮ ॥ ೩೫ ॥
ಎಲ್ಲೆಲ್ಲಿಯುಂ ಮೋಹಸಂಭ್ರಾಂತಿಗಳ ಕವಿಸಿ ।<br />ಸಲ್ಲದ ಕುಮಾರ್ಗದೊಳು ನಿನ್ನ ತಾಂ ನಡಸಿ ॥<br />ಗೆಲ್ಲಲಿಲ್ಲವನಾ ಪರೀಕ್ಷೆಯೊಳಗೆಂದು ವಿಧಿ ।<br />ಸೊಲ್ಲಿಪುದು ಸರಿಯೇನೋ? – ಮಂಕುತಿಮ್ಮ ॥ ೩೬ ॥
ಅವತರಿಸಿಹನು ಬೊಮ್ಮ ವಿಶ್ವದೇಹದೊಳೆನ್ನೆ ।<br />ಅವನ ವೇಷಗಳೇಕೆ ಮಾರ್ಪಡುತಲಿಹವು? ॥<br />ತವಕಪಡನೇತಕೋ ಕುರುಹ ತೋರಲು ನಮಗೆ ।<br />ಅವಿತುಕೊಂಡಿಹುದೇಕೋ? – ಮಂಕುತಿಮ್ಮ ॥ ೩೭ ॥
ಬೇರಯಿಸಿ ನಿಮಿಷನಿಮಿಷಕಮೊಡಲಬಣ್ಣಗಳ ।<br />ತೋರಿಪೊಸರವಳ್ಳಿಯಂತೇನು ಬೊಮ್ಮಂ? ॥<br />ಪೂರ ಮೈದೋರೆನೆಂಬಾ ಕಪಟಿಯಂಶಾವ ।<br />ತಾರದಿಂದಾರ್ಗೇನು? – ಮಂಕುತಿಮ್ಮ ॥ ೩೮ ॥
ಪುಸಿಯ ನೀಂ ಪುಸಿಗೈದು ದಿಟವ ಕಾಣ್ಬವೊಲೆಸಗೆ ।<br />ಮುಸುಕ ತಳೆದಿಹನು ಪರಬೊಮ್ಮನೆನ್ನುವೊಡೆ ॥<br />ಒಸೆದೇತಕವನೀಯನೆಮಗೊಂದು ನಿಜಕುರುಹ ।<br />ನಿಶೆಯೊಳುಡುಕರದವೊಲು? – ಮಂಕುತಿಮ್ಮ ॥ ೩೯ ॥
ನಿಶಿಯೊಳೇಂ ಕಾಣಬಾರನು ಹಗಲನೊಲ್ಲದೊಡೆ ।<br />ಶಶಿರವಿಗಳವನ ಮನೆಕಿಟಕಿಯಾಗಿರರೇಂ? ॥<br />ಮುಸುಕುಬೆಳಕೊಂದಾದ ಸಂಜೆಮಂಜೇನವನು ।<br />ಮಿಸುಕಿ ಸುಳಿಯುವ ಸಮಯ? – ಮಂಕುತಿಮ್ಮ ॥ ೪೦ ॥
ಕದಕಗಳಿಯನು ಬಿಗಿದು ಬೊಮ್ಮ ಗುಡಿಯೊಳಗಿರಲಿ ।<br />ಅದರ ಕೀಲ್ಕುಂಚಿಕೆಯ ಹೊರಕೆಸೆಯೆ ಸಾಕು ॥<br />ಪದವಾಕ್ಯವಿದರಾಗ ವಾದಗಡಣೆಯ ಬಿಟ್ಟು ।<br />ಒದವಿಪರು ದಿಟದರಿವ – ಮಂಕುತಿಮ್ಮ ॥ ೪೧ ॥
ಆಹ! ಈ ಮೋಹಗಳೊ ನೇಹಗಳೊ ದಾಹಗಳೊ ।<br />ಊಹಿಪೆಯ ಸೃಷ್ಟಿಯಲಿ ಹೃದಯಮಿಹುದೆಂದು? ॥<br />ಹೋಹೊ ಹಾಹಾ ಎಂದು ನಮ್ಮ ಬಾಯ್ಬಿಡಿಸುವುದೆ ।<br />ಈ ಹರಿಬದೊಳಗುಟ್ಟೊ? – ಮಂಕುತಿಮ್ಮ ॥ ೪೨ ॥
ಮೇಲೆ ಕೆಳಗೊಳಗೆ ಬಳಿ ಸುತ್ತಲೆತ್ತೆತ್ತಲುಂ ।<br />ಮೂಲೆಮೂಲೆಯಲಿ ವಿದ್ಯುಲ್ಲಹರಿಯೊಂದು  ॥<br />ಧೂಲಿಕಣ ಭೂಗೋಳ ರವಿ ಚಂದ್ರ ತಾರೆಗಳ ।<br />ಚಾಲಿಪುದು ಬಿಡು ಕೊಡದೆ – ಮಂಕುತಿಮ್ಮ ॥ ೪೩ ॥
ಮಂದಾಕ್ಷಿ ನಮಗಿಹುದು. ಬಲುದೂರ ಸಾಗದದು ।<br />ಸಂದೆ ಮಸಕಿನೊಳಿಹುದು ಜೀವನದ ಪಥವು ॥<br />ಒಂದುಮೆಟುಕದು ಕೈಗೆ; ಏನೊ ಕಣ್ಕೆಣಕುವುದು ।<br />ಸಂದಿಯವೆ ನಮ್ಮ ಗತಿ! – ಮಂಕುತಿಮ್ಮ ॥ ೪೪ ॥
ಬೆಂಕಿಯುಂಡೆಯ ಬೆಳಕು ಬೆಣ್ಣೆಯುಂಡೆಯ ಬೆಳಕು ।<br />ಮಂಕುವಿಡಿಸಲು ಸಾಕು ಮಣ್ಣುಂಡೆ ಕಣ್ಗೆ ॥<br />ಶಂಕೆಗೆಡೆಯಿರದು ಕತ್ತಲೆಯೆ ಜಗವನು ಕವಿಯೆ ।<br />ಬೊಂಕುದೀವಿಗೆ ತಂಟೆ – ಮಂಕುತಿಮ್ಮ ॥ ೪೫ ॥
ಇರಲಿ ಜೀವರಹಸ್ಯವರೆಪರದೆಯೊಳಗಡಗಿ ।<br />ಅರಸಿ ವರಿಸುವರಾರು ಬೀದಿಬತ್ತಲಿಯ? ॥<br />ಅರಳಿಪುದದಡಗಿರ್ದೊಡಾಗ ನಮ್ಮದೆಗಣ್ಣ ।<br />ಸುರಸತೆಯ ಕುತುಕದಿಂ – ಮಂಕುತಿಮ್ಮ ॥ ೪೬ ॥
ಅರೆಗಣ್ಣು ನಮದೆಂದು ಕೊರಕೊರಗಿ ಫಲವೇನು? ।<br />ಅರೆಬೆಳಕು ಧರೆಯೊಳೆಂದೊರಲಿ ಸುಖವೇನು? ॥<br />ಇರುವ ಕಣ್ಣಿರುವ ಬೆಳಕಿನೊಳಾದನಿತ ನೋಡಿ ।<br />ಪರಿಕಿಸಿದೊಡದು ಲಾಭ – ಮಂಕುತಿಮ್ಮ ॥ ೪೭ ॥
ಒಂದಿಹುದುಪಾಯವೋರೊರ್ವನರೆಗಣ್ಣುಗಳು ।<br />ಮೊಂದೊಂದು ಸತ್ಯಾಂಶಕಿರಣಗಳ ಪಿಡಿದು ॥<br />ಒಂದುಗೂಡಿದೊಡವರ್ಗಳರಿವನೆಲ್ಲವನಾಗ ।<br />ಮುಂದು ಸಾಗುವೆವಿನಿತು – ಮಂಕುತಿಮ್ಮ ॥ ೪೮ ॥
ಪಂಡಿತರೆ ಶಾಸ್ತ್ರಿಗಳೆ ಮಿಥ್ಯೆಯಿಂ ತಥ್ಯಕ್ಕೆ ।<br />ಖಂಡಿತದಿ ಸೇತುವೆಯ ಕಟ್ಟುವೊಡೆ ನೀವು ॥<br />ಕಂಡಿಹಿರ ನರಹೃದಯದಾಳ ಸುಳಿ ಬಿರುಬುಗಳ? ।<br />ದಂಡವದನುಳಿದ ನುಡಿ – ಮಂಕುತಿಮ್ಮ ॥ ೪೯ ॥
ಮನೆಯೆಲ್ಲಿ ಸತ್ಯಕ್ಕೆ? ಶ್ರುತಿ ತರ್ಕಮಾತ್ರದೊಳೆ? ।<br />ಅನುಭವಮುಮದರೊಂದು ನೆಲೆಯಾಗದಿಹುದೇಂ? ॥<br />ಮನುಜಹೃದಯಾಂಗಣದೊಳೆನಿತೆನಿತೊ ದನಿಯುದಿಸಿ ।<br />ಅಣಕಿಪುವು ತರ್ಕವನು – ಮಂಕುತಿಮ್ಮ ॥ ೫೦ ॥
ಸೆಳೆಯುತಿರ್ಪುವದೊಂದು ಹೊರಬೆಡಗಿನೆಳೆಗಳೆ ।<br />ನ್ನೊಳಗಿನಸುವೆಲ್ಲವನು ಕಟ್ಟಿನಿಂ ಬಿಗಿದು ॥<br />ಎಳೆದಾಟವೇಂ ಋಣಾಕರ್ಷಣೆಯೊ? ಸೃಷ್ಟಿವಿಧಿ ।<br />ಯೊಳತಂತ್ರವೊ? ನೋಡು – ಮಂಕುತಿಮ್ಮ ॥ ೫೧ ॥
ಗಗನನೀಲಿಮೆಯೆನ್ನ ಕಣ್ಗೆ ಸೊಗೆವೀವಂತೆ ।<br />ಮುಗಿವ ತರಣಿಯ ರಕ್ತ ಹಿತವೆನಿಸದೇಕೋ! ॥<br />ಸೊಗದ ಮೂಲವದೆಲ್ಲಿ ನೀಲದೊಳೊ ಕೆಂಪಿನೊಳೊ ।<br />ಬಗೆವೆನ್ನ ಮನಸಿನೊಳೊ? – ಮಂಕುತಿಮ್ಮ ॥ ೫೨ ॥
ತೃಣಕೆ ಹಸಿರೆಲ್ಲಿಯದು? ಬೇರಿನದೆ? ಮಣ್ಣಿನದೆ? ।<br />ದಿನಪನದೆ? ಚಂದ್ರನದೆ? ನೀರಿನದೆ? ನಿನದೆ? ॥<br />ತಣಿತಣಿವ ನಿನ್ನ ಕಣ್ಣಿನ ಪುಣ್ಯವೋ? ನೋಡು ।<br />ಗುಣಕೆ ಕಾರಣವೊಂದೆ? – ಮಂಕುತಿಮ್ಮ ॥ ೫೩ ॥
ಫಲವಿಲ್ಲ ಕಾರ್ಯಕಾರಣವಾದದಿಂ ತತ್ತ್ವ ।<br />ಸಿಲುಕದೆಮ್ಮಯ ತರ್ಕಕರ್ಕಶಾಂಕುಶಕೆ  ॥<br />ಸುಳಿವುದಾಗೀಗಳದು ಸೂಕ್ಷ್ಮಾನುಭವಗಳಲಿ ।<br />ತಿಳಿಮನದೆ ನೋಳ್ಪರ್ಗೆ – ಮಂಕುತಿಮ್ಮ ॥ ೫೪ ॥
ಕುರುಡನಿನಚಂದ್ರರನು ಕಣ್ಣಿಂದ ಕಾಣುವನೆ? ।<br />ಅರಿಯುವಂ ಸೋಂಕಿಂದೆ ಬಿಸಿಲುತಣಿವುಗಳ ॥<br />ನರನುಮಂತೆಯೆ ಮನಸಿನನುಭವದಿ ಕಾಣುವನು ।<br />ಪರಸತ್ತ್ವಮಹಿಮೆಯನು – ಮಂಕುತಿಮ್ಮ ॥ ೫೫ ॥
ಮೇಲಿಂದ ನಕ್ಷತ್ರಜಯಘೋಷ ಸುತ್ತಣಿಂ ।<br />ಭೂಲೋಕದರಚು ಕೆಳಗಿಂ ಮೂಳೆಯಳುವು ॥<br />ಕೇಳಬರುತೀ ಮೂರು ಕೂಗೆನ್ನ ಹೃದಯದಲಿ ।<br />ಮೇಳಯಿಸುತಿದೆ ಸಂತೆ – ಮಂಕುತಿಮ್ಮ ॥ ೫೬ ॥
ಆಗುಂಬೆಯಸ್ತಮಯ ದ್ರೋಣಪರ್ವತದುದಯ ।<br />ತ್ಯಾಗರಾಜನ ಗಾನ ವಾಲ್ಮೀಕಿ ಕವನ ॥<br />ಆಗಿಸವೆ ತಾವಿವೆಮ್ಮಂತರಂಗದಿ ಸತ್ಯ ।<br />ಯೋಗಪುಲಕಾಂಕುರವ? – ಮಂಕುತಿಮ್ಮ ॥ ೫೭ ॥ 
ಮಲೆಕಣಿವೆಗಳ ಬೆರಗು ಪ್ರಕೃತಿಕೊಪದ ಗುಡುಗು ।<br />ಕಳೆಯೊಲವು ನಲ್ಲೆಯ ವಿಯೊಗವಿಂತಹವು ॥<br />ನಿಲಿಸಿ ಮನದೋಟವನು ಮೂಕಗೊಳಿಪುವುವೆನ್ನ ।<br />ನೊಳದನಿಯದೊಂದರಿಂ – ಮಂಕುತಿಮ್ಮ ॥ ೫೮ ॥
ಮಣಿಮಂತ್ರತಂತ್ರಸಿದ್ಧಿಗಳ ಸಾಕ್ಷ್ಯಗಳೇಕೆ ।<br />ಮನಗಾಣಿಸಲು ನಿನಗೆ ದೈವದದ್ಭುತವ? ॥<br />ಮನುಜರೊಳಗಾಗಾಗ ತೋರ್ಪ ಮಹನೀಯಗುಣ ।<br />ವನುವಾದ ಬೊಮ್ಮನದು – ಮಂಕುತಿಮ್ಮ ॥ ೫೯ ॥
ಗ್ರೀಸಿನಾ ಕಬ್ಬಗಳನೋದುವರು ದೆಹಲಿಯಲಿ ।<br />ಕಾಶಿಯಾ ಶಾಸ್ತ್ರಗಳನಾಕ್ಸ್ ಫರ್ಡಿನವರು‍ ॥<br />ದೇಶಕಾಲವಿಭಾಗ ಮನದ ರಾಜ್ಯದೊಳಿರದು  ।<br />ಶ್ವಾಸವದು ಬೊಮ್ಮನದು – ಮಂಕುತಿಮ್ಮ ॥ ೬೦ ॥
ನಕ್ಷತ್ರಮಂಡಲದಿನಾಚೆಯಿಂದೊಂದು ದನಿ ।<br />ವಕ್ಷೋಗುಹಾಂತರದಿನೊಂದು ದನಿಯಿಂತೀ ॥<br />ಸಾಕ್ಷಿದ್ವಯವು ನಿನ್ನೊಳೊಂದುಗೂಡಿದೊಡದೇ ।<br />ಪ್ರೇಕ್ಷೆ ಪರಬೊಮ್ಮನದು – ಮಂಕುತಿಮ್ಮ ॥ ೬೧ ॥
ಭೌತವಿಜ್ಞಾನಿ ರವಿತಾರೆಧರೆಗಳ ಚಲನ ।<br />ರೀತಿ ವೇಗವನೆಳೆದು ಶಕ್ತಿಗಳ ಗುಣಿಪನ್ ॥<br />ಪ್ರೀತಿ ರೋಷಗಳನವನಳೆವನೇನ್? ಅವ್ಯಕ್ತ ।<br />ಚೇತನವನರಿವನೇಂ? – ಮಂಕುತಿಮ್ಮ ॥ ೬೨ ॥
ನರಭಾಷೆ ಬಣ್ಣಿಪುದೆ ಪರಸತ್ತ್ವರೂಪವನು? ।<br />ಅರಿಯದದು ನಮ್ಮೆದೆಯ ಭಾವಗಳನೊರೆಯೆ ॥<br />ಪರಮಾನುಭವಗಳುಲಿಯನುಭವಿಗಳೊಳಕಿವಿಗೆ ।<br />ಒರಟುಯಾನವೊ ಭಾಷೆ – ಮಂಕುತಿಮ್ಮ ॥ ೬೩ ॥
ಚಿತ್ತದನುಭವ ಭಾವ ಸಂಭಾವನೆಗಳೆಲ್ಲ ।<br />ಭತ್ತವದನು ವಿಚಾರಯುಕ್ತಿಗಳು ಕುಟ್ಟೆ ॥<br />ತತ್ತ್ವತಂಡುಲ ದೊರೆಗುಮದು ವಿವೇಚಿತತತ್ತ್ವ ।<br />ನಿತ್ಯ ಭೋಜನ ನಮಗೆ – ಮಂಕುತಿಮ್ಮ ॥ ೬೪ ॥
ಪುಸ್ತಕದಿ ದೊರೆತರಿವು ಮಸ್ತಕದಿ ತಳೆದ ಮಣಿ ।<br />ಚಿತ್ತದೊಳು ಬೆಳೆದರಿವು ತರು ತಳೆದ ಪುಷ್ಪ ॥<br />ವಸ್ತು ಸಾಕ್ಷಾತ್ಕಾರವಂತರೀಕ್ಷಣೆಯಿಂದ ।<br />ಶಾಸ್ತ್ರಿತನದಿಂದಲ್ಲ – ಮಂಕುತಿಮ್ಮ ॥ ೬೫ ॥
ವ್ಯರ್ಥವೆಂದೆನಿಪುದಲ ಸೃಷ್ಟಿಯಲಿ ಬಹುಭಾಗ? ।<br />ಅರ್ಥವೇಂ ಕ್ರಿಮಿಕೀಟಕೋಟಿ ರಚನೆಯಲಿ? ॥<br />ಕರ್ತನಾಲೋಚಿಸದ ದುಂದಿನವನೆಂಬ ನುಡಿ ।<br />ಯರ್ಧದೃಷ್ಟಿಯ ವಿವರ – ಮಂಕುತಿಮ್ಮ ॥ ೬೬ ॥
ಸ್ರಷ್ಟುಸಂಕಲ್ಪಲಿಪಿಯೆಲ್ಲ ನಮ್ಮೆದುರಿಲ್ಲ ।<br />ದೃಷ್ಟಿಗೋಚರವದರೊಳೊಂದು ಗೆರೆ ಮಾತ್ರ ॥<br />ಅಷ್ಟರಿಂದಿದು ನಷ್ಟವದು ಶಿಷ್ಟವೆನ್ನುವುದೆ? ।<br />ಕ್ಲಿಷ್ಟದ ಸಮಸ್ಯೆಯದು – ಮಂಕುತಿಮ್ಮ ॥ ೬೭ ॥
ಎಲ್ಲ ಅರೆಬೆಳಕು ಅರೆಸುಳಿವು ಅರೆತಿಳಿವಿಲ್ಲಿ ।<br />ಎಲ್ಲಿ ಪರಿಪೂರಣವೊ ಅದನರಿಯುವನಕ ॥<br />ಸೊಲ್ಲಿಸುವರಾರು ಸೃಷ್ಟಿಯ ಪೇಟಿಯೊಳಗುಟ್ಟ? ।<br />ಎಲ್ಲ ಬಾಳು ರಹಸ್ಯ – ಮಂಕುತಿಮ್ಮ ॥ ೬೮ ॥
ಹೆಸರನರಿಯದ ಸಸಿಯೊಳಿರವೆ ರಸಗಂಧಗಳು? ।<br />ಬಿಸಿಲದನು ಪಕ್ವಗೊಳಿಸುತೆ ಬಿಡಿಸದಿಹುದೆ? ॥<br />ಪಸರಿಸದೆ ಗಾಳಿಯದನೊಯ್ದು ದಿಸೆದಿಸೆಗಳೊಳು ।<br />ಉಸಿರುತಿಹೆವದ ನಾವು  – ಮಂಕುತಿಮ್ಮ ॥ ೬೯ ॥
ಭೂವಿಷಯದಲಿ ಪುದಿದ ರಸವಾಸನೆಗಳೆಲ್ಲ  ।<br />ಆವಿಯಾಗೇಳ್ದು ಮುಗಿಲಾಗಿ ಮಳೆಗರೆದು  ॥<br />ಬಾವಿಗೂಟೆಯನಿತ್ತು ನರರೊಡಲ ಸೇರುವುದು ।<br />ದೈವ ರಸತಂತ್ರವಿದು – ಮಂಕುತಿಮ್ಮ ॥ ೭೦ ॥
ತರಣಿ ಕಿರಣದ ನಂಟು ಗಗನ ಸಲಿಲದ ನಂಟು ।<br />ಧರಣಿ ಚಲನೆಯ ನಂಟು ಮರುತನೊಳ್ನಂಟು ॥<br />ಪರಿಪರಿಯ ನಂಟುಗಳಿನೊಂದು ಗಂಟೀ ವಿಶ್ವ ।<br />ಕಿರಿದು ಪಿರಿದೊಂದಂಟು – ಮಂಕುತಿಮ್ಮ ॥ ೭೧ ॥
ಈ ವಿಶ್ವದಲಿ ನೋಡಲೆಲ್ಲರೆಲ್ಲರ ನಂಟು ।<br />ಅವನಾ ಬಂಧುತೆಯ ಜಡೆಯ ಬಿಡಿಸುವನು? ॥<br />ಜೀವ ಜೀವಕೆ ನಂಟು ಜಡ ಚೇತನಕೆ ನಂಟು ।<br />ಆವುದದಕಂಟಿರದು? – ಮಂಕುತಿಮ್ಮ ॥ ೭೨ ॥
ನಂಟು ತಂಟೆಗಳ ಗಂಟೀ ಬ್ರಹ್ಮಭಂಡಾರ ।<br />ಅಂಟಿಲ್ಲವೆನಗಿದರೊಳೆನ್ನದಿರದೆಂದುಂ ॥<br />ಒಂಟಿ ನೀನೊಳಜಗಕೆ ಭಂಟ ಹೊರಜಗಕಾಗಿ ।<br />ಒಂಟಿಸಿಕೊ ಜೀವನವ – ಮಂಕುತಿಮ್ಮ ॥ ೭೩ ॥
ಸುಮ್ಮನೊಬ್ಬಂಟಿಯೆಂತಿಹುದು? ಬೇಸರವಹುದು  ।<br />ಹೊಮ್ಮುವೆನು ಕೋಟಿರೂಪದಲಿ ನಾನೆಂದು ॥<br />ಬೊಮ್ಮನೆಳಸಿದನಂತೆ. ಆ ಯೆಳಸಿಕೆಯೆ ಮಾಯೆ ।<br />ನಮ್ಮಿರವು ಮಾಯೆಯಲಿ – ಮಂಕುತಿಮ್ಮ ॥ ೭೪ ॥
ಮರ ತನ್ನ ಹೆತ್ತ ಬೀಜವನಿಲ್ಲವೆನಿಸಿ ವಿ- ।<br />ಸ್ತರಿಸುವಂದದಿ, ಸೃಷ್ಟಿ ತನ್ನ ಮೂಲವನು ॥<br />ಮರೆಮಾಚಿ ತಾನೆ ಮೆರೆಯುತ್ತಿಹುದು ಕಣ್ಗಳಿಗೆ ।<br />ನೊರೆ ಸೃಷ್ಟಿ ಪಾಲ್ ಬ್ರಹ್ಮ – ಮಂಕುತಿಮ್ಮ ॥ ೭೫ ॥
ಬಹುವಾಗಲೆಳಸಿ ತಾನೊಬ್ಬಂಟಿ ಬೊಮ್ಮ ನಿಜ ।<br />ಮಹಿಮೆಯಿಂ ಸೃಜಿಸಿ ವಿಶ್ವವನಲ್ಲಿ ನೆಲಸಿ ॥<br />ವಹಿಸಿ ಜೀವತೆಯ ಮಾಯೆಯ ಸರಸವಿರಸದಲಿ ।<br />ವಿಹರಿಪನು ನಿರ್ಲಿಪ್ತ! – ಮಂಕುತಿಮ್ಮ ॥ ೭೬ ॥
ತನ್ನ ಹೊಳಹೊಳಪುಗಳ ನೆನೆನೆನೆದು ಮೈಮರೆತ ।<br />ರನ್ನವೋ ಬ್ರಹ್ಮ; ನೋಡುವನು-ನಿಜಪಿಂಛ ॥<br />ವರ್ಣದೆಣಿಕೆಯಲಿ ತನ್ನನೆ ಮರೆತ ನವಿಲವೊಲು ।<br />ತನ್ಮಯನೊ ಸೃಷ್ಟಿಯಲಿ – ಮಂಕುತಿಮ್ಮ ॥ ೭೭ ॥
ತರುಣಿ ತನ್ನೊಡವೆಗಳ ತಳೆಯುತ್ತ ತೆಗೆಯುತ್ತ ।<br />ಪರಕಿಸುತೆ ಮುಕರದಲಿ ಸೊಗಸುಗಳ ಪರಿಯ ॥<br />ಮರೆತೆಲ್ಲವನು ವಿಲಸಿಪಂತೆ ತಾಂ ವಿಶ್ವದಲಿ ।<br />ಮೆರೆಯುವನು ಪರಬೊಮ್ಮ – ಮಂಕುತಿಮ್ಮ ॥ ೭೮ ॥
ಬರೆವ ಹಲಗೆಯನೊಡೆದು ಬಾಲಕನು ತಾನದನು ।<br />ಮರಳಿ ಜೋಡಿಪೆನೆನ್ನುತಾಯಾಸಗೊಳುತ ॥<br />ಸರಿಚೌಕಗೈವಾಟದಲಿ ಜಗವ ಮರೆವಂತೆ ।<br />ಪರಬೊಮ್ಮ ಸೃಷ್ಟಿಯಲಿ – ಮಂಕುತಿಮ್ಮ ॥ ೭೯ ॥
ಚೀಟಿಯಾಟದ ಬಿನದಿ ತಾನೊರ್ವನಿರ್ವರವೊಲ್ ।<br />ಆಟವಾಡುತಲಿ ತನ್ನೊರ್ ತನವ ಮೆರೆವಾ ॥<br />ಮಾಟದಲಿ ಬೊಮ್ಮನುಂ ತನ್ನೇಕತೆಯ ಜೀವ ।<br />ಪಾಟಿಯಲಿ ಮರೆತಿಹನು – ಮಂಕುತಿಮ್ಮ ॥ ೮೦ ॥
ಮರೆತಿಹನೆ ಬೊಮ್ಮ? ಮರೆತಿಲ್ಲ; ಮರೆತವೊಲಿಹನು ।<br />ಧರಿಸಿ ಜೀವಾಕೃತಿಯ ಜಗದಿ ತನ್ನನೆ ತಾನ್ ॥<br />ಅರಸಿಕೊಳುವವೊಲಿಹುದು; ದೊರೆತವೊಲ್ ತೋರೆ ಸುಖ ।<br />ದೊರೆವವರೆಗಾಯಸವೊ – ಮಂಕುತಿಮ್ಮ ॥ ೮೧ ॥
ಬನ್ನಿರಾಡುವ ಕಣ್ಣ ಮುಚ್ಚಾಲೆಯಾಟವನು ।<br />ಎನ್ನನರಸಿರಿ ಬನ್ನಿ ಮಕ್ಕಳಿರ ಬೇಗ ॥<br />ಬನ್ನಿರಾಟವ ಬೇಡವೆಂಬರನು ನಾಂ ಬಿಡೆನು ।<br />ಎನ್ನುವಜ್ಜಿಯೊ ಬೊಮ್ಮ – ಮಂಕುತಿಮ್ಮ ॥ ೮೨ ॥
ಮಾನಸವ ಚಿಂತೆವಿಡಿದಂದೊರ್ವನೆರಡಾಗಿ ।<br />ತಾನದಾರೊಳೊ ವಾದಿಸುವನಂತೆ ಬಾಯಿಂ ॥<br />ದೇನನೊ ನುಡಿಯುತ್ತ ಕೈಸನ್ನೆಗೈಯುವನು ।<br />ಭಾನವೊಂದರೊಳೆರಡು – ಮಂಕುತಿಮ್ಮ ॥ ೮೩ ॥
ಅಣು ಭೂತ ಭೂಗೋಲ ತಾರಾಂಬರಾದಿಗಳ ।<br />ನಣಿಮಾಡಿ ಬಿಗಿದು ನಸು ಸಡಿಲವನುಮಿರಿಸಿ ॥<br />ಕುಣಿಸುತಿರುವನು ತನ್ನ ಕೃತಿಕಂತುಕವನದರೊ ।<br />ಳಣಗಿದ್ದು ಪರಬೊಮ್ಮ – ಮಂಕುತಿಮ್ಮ ॥ ೮೪ ॥
ನಭದ ಬಯಲೊಳನಂತ, ಮನದ ಗುಹೆಯೊಳನಂತ ।<br />ವುಭಯದಾ ನಡುವೆ ಸಾದ್ಯಂತ ಜೀವಕಥೆ ॥<br />ವಿಭುವೊಬ್ಬನೀ ಗಾಳಿಬುಡ್ಡೆಗಳನೂದುವನು ।<br />ಹಬೆಗುಳ್ಳೆಯೋ ಸೃಷ್ಟಿ – ಮಂಕುತಿಮ್ಮ ॥ ೮೫ ॥
ಗಗನ ತಲೆನವಿರಾಗೆ ಪರೆ ತಾರೆ ಹೂವಾಗೆ ।<br />ಜಗವೆಲ್ಲ ವಪುವಾಗೆ ಮಾಯೆ ಸತಿಯಾಗೆ ॥<br />ನಗುನಗುವ ಬೊಬ್ಬಿಡುವ ಜೀವತಾಂಡವ ರಸಿಕ ।<br />ಭಗವಂತ ಶಿವರುದ್ರ – ಮಂಕುತಿಮ್ಮ ॥ ೮೬ ॥
ಬೆಳೆ ಹೊಳಪು ವಿಕಸನ ವಿಕಾರ ಸಂಭ್ರಮಗಳಲಿ ।<br />ಬೆಳಕು ವೇಗಗಳೆನಿಪ ಕಾಲ ದಿಕ್ಕುಗಳ ॥<br />ಚಲನೆಯಲಿ ವಿಶ್ವಸಂಮೋಹನಗಳೆಲ್ಲವಾ ।<br />ವಿಲಸಿತವು ಬೊಮ್ಮನದು – ಮಂಕುತಿಮ್ಮ ॥ ೮೭ ॥
ಚಲನೆ ವಿಶ್ವಾಸ್ತರಣೆಯದುವೆ ಮಾಯಾಭ್ರಮಣೆ ।<br />ಸಲೆ ಬಗೆಯಲದು ಪರಬ್ರಹ್ಮ ವಿಸ್ಫುರಣೆ ॥<br />ಥಳಥಳಕೆ ವಜ್ರದಲಿ ನೈಜವಿರುವಂತೆಯು ।<br />ಜ್ಜ್ವಲತೆ ಬೊಮ್ಮಗೆ ನೈಜ – ಮಂಕುತಿಮ್ಮ ॥ ೮೮ ॥
ಆದಿದಿವಸವದಾವುದೆಂದೆಂದುಮಿಹ ಜಗಕೆ? ।<br />ಬೋಧನೆಯ ಸುಲಭತೆಗೆ ಸೃಷ್ಟಿಲಯಕಥನ ॥<br />ಪಾದಶಿರಗಳ ಕೂರ್ಮ ಚಾಚಿಕೊಂಡಿರೆ ಸೃಷ್ಟಿ ।<br />ಸೇದಿಕೊಂಡಿರೆ ಲಯವೊ – ಮಂಕುತಿಮ್ಮ ॥ ೮೯ ॥
ಆವುದಿರುವಿಕೆಗಾದಿ? ಎಂದು ಸೃಷ್ಟಿಯ ಮೊದಲು? ।<br />ಆವುದಬ್ಧಿಯ ತೆರೆಗಳಲಿ ಮೊಟ್ಟಮೊದಲು? ॥<br />ಆವುದೆಲರಿನ ನಿಲ್ಲದಲೆತಕ್ಕೆ ಪಡುಸೀಮೆ? ।<br />ಈ ವಿಶ್ವಕಥೆಯಂತು – ಮಂಕುತಿಮ್ಮ ॥ ೯೦ ॥
ಕಮಲವುದಯದೊಳರಳಿ ಸಂಜೆಯಲಿ ಮುಗುಳಾಗಿ ।<br />ಸುಮವಪ್ಪುದಂತೆ ಮರುವಗಲು ಮುಗುಳ್ದಂತು ॥<br />ಅಮಿತ ಪ್ರಪಂಚನಾಕುಂಚನಾವರ್ತನ ।<br />ಕ್ರಮವೆ ವಿಶ್ವಚರಿತ್ರೆ – ಮಂಕುತಿಮ್ಮ ॥ ೯೧ ॥
ಎತ್ತಣಿನೊ ದೃಕ್ಷರಿಧಿಯಾಚೆಯಿಂದಲನಂತ ।<br />ಸತ್ತ್ವ ತೆರೆತೆರೆಯಾಗಿ ಬೀಸಿ ಗೂಢದಲಿ ॥<br />ಬಿತ್ತರಿಸುತಿಹುದು ಹೊಸ ಹೊಸತನವನೆಡೆಬಿಡದೆ ।<br />ನಿತ್ಯನಿತ್ಯವು ಜಗದಿ – ಮಂಕುತಿಮ್ಮ ॥ ೯೨ ॥
ಜ್ವಾಲಮಾಲಾಕುಲ ಜಗದ್ರೂಪ ತಾಂಡವದಿ ।<br />ಲೀಲೆಯಿಂ ಜೀವತೆಯನಾಂತು ಪರಬೊಮ್ಮಂ ॥<br />ತಾಳಲಯಮೇಳನದಿನೊಮ್ಮೆ ರಭಸದಿನೊಮ್ಮೆ ।<br />ಲೊಲನಾಗಿರ್ಪನೆಲೊ – ಮಂಕುತಿಮ್ಮ ॥ ೯೩ ॥
ಕೇಳಿಯುಂ ಮಾಯೆಯದು; ನೃತ್ಯಗತಿ ಬರಿತೋರ್ಕೆ ।<br />ಮೂಲಮಂ ಕಂಡಂಗೆ ಸಂಭ್ರಾಂತಿಯೇನು? ॥<br />ಆಳದಲಿ ನಿರ್ಲಿಪ್ತ ಮೇಲೆ ನಿಯತಿಕ್ಲುಪ್ತ ।<br />ಲೀಲಾಪ್ರಿಯಂ ಬ್ರಹ್ಮ – ಮಂಕುತಿಮ್ಮ ॥ ೯೪ ॥
ಶ್ಯಾಮಸುಂದರನವನೆ ಚಕ್ರಿ ನರಹರಿಯಂತೆ ।<br />ಸೋಮಶಂಕರನೆ ಭೈರವ ರುದ್ರನಂತೆ ॥<br />ಹೈಮವತಿ ಶಿವೆ ತಾನೆ ಕಾಳಿ ಚಂಡಿಕೆಯಂತೆ ।<br />ಪ್ರೇಮ ಘೋರಗಳೊಂದೆ! – ಮಂಕುತಿಮ್ಮ ॥ ೯೫ ॥
ಸತ್ಯವೆಂಬುದದೇನು ಬ್ರಹ್ಮಾಂಡ ತಾಂಡವದಿ  ।<br />ಸತ್ಯವೇ ಸತ್ಯವಲ ಕಡಲಲೆಯ ಬಾಳೊಳ್ ॥<br />ಮಿಥ್ಯೆಯೆಂಬುದೆ ಮಿಥ್ಯೆ; ಜೀವನಾಟಕ ಸತ್ಯ ।<br />ಕೃತ್ಯವಿದು ಬೊಮ್ಮನದು – ಮಂಕುತಿಮ್ಮ ॥ ೯೬ ॥
ಧರ್ಮವೆಂಬುದದೇನು? ಕರ್ಮವೆಂಬುದದೇನು? ।<br />ಬ್ರಹ್ಮಾಂಡಕಥೆಯೇನು? ಜೀವಿತವಿದೇನು? ॥<br />ಬ್ರಹ್ಮವೆಲ್ಲಕು ಮೂಲ ಮಾಯೆ ತತ್ಕೃತಿಜಾಲ ।<br />ಬ್ರಹ್ಮವೇ ಜೀವನವೊ – ಮಂಕುತಿಮ್ಮ ॥ ೯೭ ॥
ವಕ್ರಋಜುಮಿಶ್ರ ಜಗವದರ ಶೋಧನೆ ಧರ್ಮ ।<br />ಪ್ರಾಕೃತಧ್ವನಿಮಿಶ್ರವದರಡುಗೆ ರಾಗ ॥<br />ವ್ಯಾಕೃತದಿನವ್ಯಾಕೃತಾದಿಸತ್ತ್ವಕೆ ನಿನ್ನ ।<br />ಜಾಗೃತಿಪ ಮತಿ ಧರ್ಮ – ಮಂಕುತಿಮ್ಮ ॥ ೯೮ ॥
ಜಲಧಿತೀರದಿ ನಿಂತು ವೀಕ್ಷಿಸಿಕ್ಕೆಲಗಳಲಿ  ।<br />ಚಲವೊಂದಚಲವೊಂದು ಸಮವದಸಮವಿದು ॥<br />ಕಲೆತಿರ್ಪುವಂತು ಮೇಯಾಮೇಯಗಳು ಜಗದಿ ।<br />ಮಿಲಿತತೆಯಿನೀ ರುಚಿಯೊ – ಮಂಕುತಿಮ್ಮ ॥ ೯೯ ॥
ಅವಿದಿತಾಖಂಡಸತ್ತ್ವದಪಾರ ಜಲಧಿಯಲಿ ।<br />ಭುವನದ ದ್ವೀಪ ಕಿಂಚಿನ್ಮಾತ್ರವಿದಿತ ॥<br />ಪವಿತಾಂತರಕ್ಷಿಗಾಯೆರಡುಮೊಂದೇ ವಸ್ತು ।<br />ವವಗುಂಠಿತ ಬ್ರಹ್ಮ – ಮಂಕುತಿಮ್ಮ ॥ ೧೦೦ ॥
ಹಾಲಿನೊಳು ಬೆಣ್ಣೆ  ಕಡಲೊಳಗೆ ನೀರ್ಗಲ್ಲವೊಲು ।<br />ತೇಲುವುದಮೇಯಸತ್ತ್ವದಲಿ ಮೇಯ ಜಗ ॥<br />ಮೂಲದಶೆಯೊಳಗೊಂದು, ಮಾಪನದ ಬಗೆಗೆರಡು ।<br />ಗಾಳಿಯುಸಿರುಗಳಂತೆ – ಮಂಕುತಿಮ್ಮ ॥ ೧೦೧ ॥
ಕಾಯ ನಿರ್ಣೇಯವದರೊಳು ಮನವನಿರ್ಣೇಯ ।<br />ಸ್ನಾಯು ಸಂಖ್ಯೇಯ ಜೀವಳಮಸಂಖ್ಯೇಯ ॥<br />ಮೇಯಾಪ್ರಮೇಯಮಿಶ್ರಣವಿಂತು ನರಜಂತು ।<br />ನೇಯವದು ವಿಶ್ವಕಂ – ಮಂಕುತಿಮ್ಮ ॥ ೧೦೨ ॥";

	// Split them into individual kaggas
	$lines = explode( "\n", $lines );

	// Randomly choose a kagga
	return wptexturize( $lines[ mt_rand( 0, count( $lines ) - 1 ) ] );
}

function show_kagga() {
	$kagga = dvg_kaggas();
	
	echo "<p id='kagga'>$kagga</p>";
}


class Mankutimmana_Kagga_Widget extends WP_Widget {
			
	function __construct() {
    	$widget_ops = array(
			'classname'   => 'mankutimmana_kagga_widget', 
			'description' => __('Show a random Kagga from D.V.G\'s Mankutimmana Kagga. ಮಾನ್ಯ ಡಿ.ವಿ.ಗುಂಡಪ್ಪನವರ ಮಂಕುತಿಮ್ಮನ ಕಗ್ಗದಿಂದ ಯಾವುದಾದರೊಂದು ಕಗ್ಗವನ್ನು ತೋರಿಸಿ.')
		);
    	parent::__construct('manku-timmana-kagga', __('Mankutimmana Kagga'), $widget_ops);
	}
	
	function widget($args, $instance) {
           
			extract( $args );
		
			$title = apply_filters( 'widget_title', empty($instance['title']) ? 'ಮಂಕುತಿಮ್ಮನ ಕಗ್ಗ' : $instance['title'], $instance, $this->id_base);	
			
			
			echo $before_widget;
			
			
			// Widget title
			
			echo $before_title;
			
			echo $instance["title"];
			
			echo $after_title;
			
			
			// Call show_kagga function
			
    			show_kagga();

		echo $after_widget;

	}
	
	function update( $new_instance, $old_instance ) {
		$instance = $old_instance;
		$instance['title'] = strip_tags($new_instance['title']);
	     
        		return $instance;
	}
	
	
	function form( $instance ) {
		$title = isset($instance['title']) ? esc_attr($instance['title']) : 'ಮಂಕುತಿಮ್ಮನ ಕಗ್ಗ';
		
?>
        <p><label for="<?php echo $this->get_field_id('title'); ?>"><?php _e('Title:'); ?></label>
        <input class="widefat" id="<?php echo $this->get_field_id('title'); ?>" name="<?php echo $this->get_field_name('title'); ?>" type="text" value="<?php echo $title; ?>" /></p>
             
<?php
	}
}

function mtk_register_widgets() {
	register_widget( 'Mankutimmana_Kagga_Widget' );
}

add_action( 'widgets_init', 'mtk_register_widgets' );
?>
